GopalSaraf/Practicals/PSDL/include/proc/pic18f27k40.inc
// Register: ADPCH
#define ADPCH ADPCH
ADPCH                                    equ 0F5Fh
// bitfield definitions
ADPCH_ADPCH_POSN                         equ 0000h
ADPCH_ADPCH_POSITION                     equ 0000h
ADPCH_ADPCH_SIZE                         equ 0006h
ADPCH_ADPCH_LENGTH                       equ 0006h
ADPCH_ADPCH_MASK                         equ 003Fh
ADPCH_ADPCH0_POSN                        equ 0000h
ADPCH_ADPCH0_POSITION                    equ 0000h
ADPCH_ADPCH0_SIZE                        equ 0001h
ADPCH_ADPCH0_LENGTH                      equ 0001h
ADPCH_ADPCH0_MASK                        equ 0001h
ADPCH_ADPCH1_POSN                        equ 0001h
ADPCH_ADPCH1_POSITION                    equ 0001h
ADPCH_ADPCH1_SIZE                        equ 0001h
ADPCH_ADPCH1_LENGTH                      equ 0001h
ADPCH_ADPCH1_MASK                        equ 0002h
ADPCH_ADPCH2_POSN                        equ 0002h
ADPCH_ADPCH2_POSITION                    equ 0002h
ADPCH_ADPCH2_SIZE                        equ 0001h
ADPCH_ADPCH2_LENGTH                      equ 0001h
ADPCH_ADPCH2_MASK                        equ 0004h
ADPCH_ADPCH3_POSN                        equ 0003h
ADPCH_ADPCH3_POSITION                    equ 0003h
ADPCH_ADPCH3_SIZE                        equ 0001h
ADPCH_ADPCH3_LENGTH                      equ 0001h
ADPCH_ADPCH3_MASK                        equ 0008h
ADPCH_ADPCH4_POSN                        equ 0004h
ADPCH_ADPCH4_POSITION                    equ 0004h
ADPCH_ADPCH4_SIZE                        equ 0001h
ADPCH_ADPCH4_LENGTH                      equ 0001h
ADPCH_ADPCH4_MASK                        equ 0010h
ADPCH_ADPCH5_POSN                        equ 0005h
ADPCH_ADPCH5_POSITION                    equ 0005h
ADPCH_ADPCH5_SIZE                        equ 0001h
ADPCH_ADPCH5_LENGTH                      equ 0001h
ADPCH_ADPCH5_MASK                        equ 0020h

// Register: ADCON0
#define ADCON0 ADCON0
ADCON0                                   equ 0F60h
// bitfield definitions
ADCON0_ADGO_POSN                         equ 0000h
ADCON0_ADGO_POSITION                     equ 0000h
ADCON0_ADGO_SIZE                         equ 0001h
ADCON0_ADGO_LENGTH                       equ 0001h
ADCON0_ADGO_MASK                         equ 0001h
ADCON0_ADFM_POSN                         equ 0002h
ADCON0_ADFM_POSITION                     equ 0002h
ADCON0_ADFM_SIZE                         equ 0001h
ADCON0_ADFM_LENGTH                       equ 0001h
ADCON0_ADFM_MASK                         equ 0004h
ADCON0_ADCS_POSN                         equ 0004h
ADCON0_ADCS_POSITION                     equ 0004h
ADCON0_ADCS_SIZE                         equ 0001h
ADCON0_ADCS_LENGTH                       equ 0001h
ADCON0_ADCS_MASK                         equ 0010h
ADCON0_ADCONT_POSN                       equ 0006h
ADCON0_ADCONT_POSITION                   equ 0006h
ADCON0_ADCONT_SIZE                       equ 0001h
ADCON0_ADCONT_LENGTH                     equ 0001h
ADCON0_ADCONT_MASK                       equ 0040h
ADCON0_ADON_POSN                         equ 0007h
ADCON0_ADON_POSITION                     equ 0007h
ADCON0_ADON_SIZE                         equ 0001h
ADCON0_ADON_LENGTH                       equ 0001h
ADCON0_ADON_MASK                         equ 0080h
ADCON0_GO_POSN                           equ 0000h
ADCON0_GO_POSITION                       equ 0000h
ADCON0_GO_SIZE                           equ 0001h
ADCON0_GO_LENGTH                         equ 0001h
ADCON0_GO_MASK                           equ 0001h
ADCON0_ADFM0_POSN                        equ 0002h
ADCON0_ADFM0_POSITION                    equ 0002h
ADCON0_ADFM0_SIZE                        equ 0001h
ADCON0_ADFM0_LENGTH                      equ 0001h
ADCON0_ADFM0_MASK                        equ 0004h
ADCON0_DONE_POSN                         equ 0000h
ADCON0_DONE_POSITION                     equ 0000h
ADCON0_DONE_SIZE                         equ 0001h
ADCON0_DONE_LENGTH                       equ 0001h
ADCON0_DONE_MASK                         equ 0001h
ADCON0_GO_NOT_DONE_POSN                  equ 0000h
ADCON0_GO_NOT_DONE_POSITION              equ 0000h
ADCON0_GO_NOT_DONE_SIZE                  equ 0001h
ADCON0_GO_NOT_DONE_LENGTH                equ 0001h
ADCON0_GO_NOT_DONE_MASK                  equ 0001h
ADCON0_GO_nDONE_POSN                     equ 0000h
ADCON0_GO_nDONE_POSITION                 equ 0000h
ADCON0_GO_nDONE_SIZE                     equ 0001h
ADCON0_GO_nDONE_LENGTH                   equ 0001h
ADCON0_GO_nDONE_MASK                     equ 0001h
ADCON0_ADCAL_POSN                        equ 0007h
ADCON0_ADCAL_POSITION                    equ 0007h
ADCON0_ADCAL_SIZE                        equ 0001h
ADCON0_ADCAL_LENGTH                      equ 0001h
ADCON0_ADCAL_MASK                        equ 0080h

// Register: ADPREV
#define ADPREV ADPREV
ADPREV                                   equ 0F61h

// Register: ADPREVL
#define ADPREVL ADPREVL
ADPREVL                                  equ 0F61h
// bitfield definitions
ADPREVL_ADPREVL_POSN                     equ 0000h
ADPREVL_ADPREVL_POSITION                 equ 0000h
ADPREVL_ADPREVL_SIZE                     equ 0008h
ADPREVL_ADPREVL_LENGTH                   equ 0008h
ADPREVL_ADPREVL_MASK                     equ 00FFh
ADPREVL_ADPREV0_POSN                     equ 0000h
ADPREVL_ADPREV0_POSITION                 equ 0000h
ADPREVL_ADPREV0_SIZE                     equ 0001h
ADPREVL_ADPREV0_LENGTH                   equ 0001h
ADPREVL_ADPREV0_MASK                     equ 0001h
ADPREVL_ADPREV1_POSN                     equ 0001h
ADPREVL_ADPREV1_POSITION                 equ 0001h
ADPREVL_ADPREV1_SIZE                     equ 0001h
ADPREVL_ADPREV1_LENGTH                   equ 0001h
ADPREVL_ADPREV1_MASK                     equ 0002h
ADPREVL_ADPREV2_POSN                     equ 0002h
ADPREVL_ADPREV2_POSITION                 equ 0002h
ADPREVL_ADPREV2_SIZE                     equ 0001h
ADPREVL_ADPREV2_LENGTH                   equ 0001h
ADPREVL_ADPREV2_MASK                     equ 0004h
ADPREVL_ADPREV3_POSN                     equ 0003h
ADPREVL_ADPREV3_POSITION                 equ 0003h
ADPREVL_ADPREV3_SIZE                     equ 0001h
ADPREVL_ADPREV3_LENGTH                   equ 0001h
ADPREVL_ADPREV3_MASK                     equ 0008h
ADPREVL_ADPREV4_POSN                     equ 0004h
ADPREVL_ADPREV4_POSITION                 equ 0004h
ADPREVL_ADPREV4_SIZE                     equ 0001h
ADPREVL_ADPREV4_LENGTH                   equ 0001h
ADPREVL_ADPREV4_MASK                     equ 0010h
ADPREVL_ADPREV5_POSN                     equ 0005h
ADPREVL_ADPREV5_POSITION                 equ 0005h
ADPREVL_ADPREV5_SIZE                     equ 0001h
ADPREVL_ADPREV5_LENGTH                   equ 0001h
ADPREVL_ADPREV5_MASK                     equ 0020h
ADPREVL_ADPREV6_POSN                     equ 0006h
ADPREVL_ADPREV6_POSITION                 equ 0006h
ADPREVL_ADPREV6_SIZE                     equ 0001h
ADPREVL_ADPREV6_LENGTH                   equ 0001h
ADPREVL_ADPREV6_MASK                     equ 0040h
ADPREVL_ADPREV7_POSN                     equ 0007h
ADPREVL_ADPREV7_POSITION                 equ 0007h
ADPREVL_ADPREV7_SIZE                     equ 0001h
ADPREVL_ADPREV7_LENGTH                   equ 0001h
ADPREVL_ADPREV7_MASK                     equ 0080h

