GopalSaraf/Practicals/PSDL/include/proc/pic18f27k40.inc
// Register: NVMADRH
#define NVMADRH NVMADRH
NVMADRH                                  equ 0F7Fh
// bitfield definitions
NVMADRH_ADR_POSN                         equ 0000h
NVMADRH_ADR_POSITION                     equ 0000h
NVMADRH_ADR_SIZE                         equ 0002h
NVMADRH_ADR_LENGTH                       equ 0002h
NVMADRH_ADR_MASK                         equ 0003h
NVMADRH_NVMADR8_POSN                     equ 0000h
NVMADRH_NVMADR8_POSITION                 equ 0000h
NVMADRH_NVMADR8_SIZE                     equ 0001h
NVMADRH_NVMADR8_LENGTH                   equ 0001h
NVMADRH_NVMADR8_MASK                     equ 0001h
NVMADRH_NVMADR9_POSN                     equ 0001h
NVMADRH_NVMADR9_POSITION                 equ 0001h
NVMADRH_NVMADR9_SIZE                     equ 0001h
NVMADRH_NVMADR9_LENGTH                   equ 0001h
NVMADRH_NVMADR9_MASK                     equ 0002h
NVMADRH_ADR8_POSN                        equ 0000h
NVMADRH_ADR8_POSITION                    equ 0000h
NVMADRH_ADR8_SIZE                        equ 0001h
NVMADRH_ADR8_LENGTH                      equ 0001h
NVMADRH_ADR8_MASK                        equ 0001h
NVMADRH_ADR9_POSN                        equ 0001h
NVMADRH_ADR9_POSITION                    equ 0001h
NVMADRH_ADR9_SIZE                        equ 0001h
NVMADRH_ADR9_LENGTH                      equ 0001h
NVMADRH_ADR9_MASK                        equ 0002h
NVMADRH_ADRH_POSN                        equ 0000h
NVMADRH_ADRH_POSITION                    equ 0000h
NVMADRH_ADRH_SIZE                        equ 0002h
NVMADRH_ADRH_LENGTH                      equ 0002h
NVMADRH_ADRH_MASK                        equ 0003h

// Register: NVMDAT
#define NVMDAT NVMDAT
NVMDAT                                   equ 0F80h
// bitfield definitions
NVMDAT_NVMDAT_POSN                       equ 0000h
NVMDAT_NVMDAT_POSITION                   equ 0000h
NVMDAT_NVMDAT_SIZE                       equ 0008h
NVMDAT_NVMDAT_LENGTH                     equ 0008h
NVMDAT_NVMDAT_MASK                       equ 00FFh
NVMDAT_NVMDAT0_POSN                      equ 0000h
NVMDAT_NVMDAT0_POSITION                  equ 0000h
NVMDAT_NVMDAT0_SIZE                      equ 0001h
NVMDAT_NVMDAT0_LENGTH                    equ 0001h
NVMDAT_NVMDAT0_MASK                      equ 0001h
NVMDAT_NVMDAT1_POSN                      equ 0001h
NVMDAT_NVMDAT1_POSITION                  equ 0001h
NVMDAT_NVMDAT1_SIZE                      equ 0001h
NVMDAT_NVMDAT1_LENGTH                    equ 0001h
NVMDAT_NVMDAT1_MASK                      equ 0002h
NVMDAT_NVMDAT2_POSN                      equ 0002h
NVMDAT_NVMDAT2_POSITION                  equ 0002h
NVMDAT_NVMDAT2_SIZE                      equ 0001h
NVMDAT_NVMDAT2_LENGTH                    equ 0001h
NVMDAT_NVMDAT2_MASK                      equ 0004h
NVMDAT_NVMDAT3_POSN                      equ 0003h
NVMDAT_NVMDAT3_POSITION                  equ 0003h
NVMDAT_NVMDAT3_SIZE                      equ 0001h
NVMDAT_NVMDAT3_LENGTH                    equ 0001h
NVMDAT_NVMDAT3_MASK                      equ 0008h
NVMDAT_NVMDAT4_POSN                      equ 0004h
NVMDAT_NVMDAT4_POSITION                  equ 0004h
NVMDAT_NVMDAT4_SIZE                      equ 0001h
NVMDAT_NVMDAT4_LENGTH                    equ 0001h
NVMDAT_NVMDAT4_MASK                      equ 0010h
NVMDAT_NVMDAT5_POSN                      equ 0005h
NVMDAT_NVMDAT5_POSITION                  equ 0005h
NVMDAT_NVMDAT5_SIZE                      equ 0001h
NVMDAT_NVMDAT5_LENGTH                    equ 0001h
NVMDAT_NVMDAT5_MASK                      equ 0020h
NVMDAT_NVMDAT6_POSN                      equ 0006h
NVMDAT_NVMDAT6_POSITION                  equ 0006h
NVMDAT_NVMDAT6_SIZE                      equ 0001h
NVMDAT_NVMDAT6_LENGTH                    equ 0001h
NVMDAT_NVMDAT6_MASK                      equ 0040h
NVMDAT_NVMDAT7_POSN                      equ 0007h
NVMDAT_NVMDAT7_POSITION                  equ 0007h
NVMDAT_NVMDAT7_SIZE                      equ 0001h
NVMDAT_NVMDAT7_LENGTH                    equ 0001h
NVMDAT_NVMDAT7_MASK                      equ 0080h

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 0F81h
// bitfield definitions
NVMCON1_RD_POSN                          equ 0000h
NVMCON1_RD_POSITION                      equ 0000h
NVMCON1_RD_SIZE                          equ 0001h
NVMCON1_RD_LENGTH                        equ 0001h
NVMCON1_RD_MASK                          equ 0001h
NVMCON1_WR_POSN                          equ 0001h
NVMCON1_WR_POSITION                      equ 0001h
NVMCON1_WR_SIZE                          equ 0001h
NVMCON1_WR_LENGTH                        equ 0001h
NVMCON1_WR_MASK                          equ 0002h
NVMCON1_WREN_POSN                        equ 0002h
NVMCON1_WREN_POSITION                    equ 0002h
NVMCON1_WREN_SIZE                        equ 0001h
NVMCON1_WREN_LENGTH                      equ 0001h
NVMCON1_WREN_MASK                        equ 0004h
NVMCON1_WRERR_POSN                       equ 0003h
NVMCON1_WRERR_POSITION                   equ 0003h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0008h
NVMCON1_FREE_POSN                        equ 0004h
NVMCON1_FREE_POSITION                    equ 0004h
NVMCON1_FREE_SIZE                        equ 0001h
NVMCON1_FREE_LENGTH                      equ 0001h
NVMCON1_FREE_MASK                        equ 0010h
NVMCON1_NVMREG_POSN                      equ 0006h
NVMCON1_NVMREG_POSITION                  equ 0006h
NVMCON1_NVMREG_SIZE                      equ 0002h
NVMCON1_NVMREG_LENGTH                    equ 0002h
NVMCON1_NVMREG_MASK                      equ 00C0h
NVMCON1_NVMREG0_POSN                     equ 0006h
NVMCON1_NVMREG0_POSITION                 equ 0006h
NVMCON1_NVMREG0_SIZE                     equ 0001h
NVMCON1_NVMREG0_LENGTH                   equ 0001h
NVMCON1_NVMREG0_MASK                     equ 0040h
NVMCON1_NVMREG1_POSN                     equ 0007h
NVMCON1_NVMREG1_POSITION                 equ 0007h
NVMCON1_NVMREG1_SIZE                     equ 0001h
NVMCON1_NVMREG1_LENGTH                   equ 0001h
NVMCON1_NVMREG1_MASK                     equ 0080h

// Register: NVMCON2
#define NVMCON2 NVMCON2
NVMCON2                                  equ 0F82h
// bitfield definitions
NVMCON2_NVMCON2_POSN                     equ 0000h
NVMCON2_NVMCON2_POSITION                 equ 0000h
NVMCON2_NVMCON2_SIZE                     equ 0008h
NVMCON2_NVMCON2_LENGTH                   equ 0008h
NVMCON2_NVMCON2_MASK                     equ 00FFh

